#ifndef STUDIO_CSGO_H
#define STUDIO_CSGO_H

#include <stdint.h>

enum Hitboxes
{
	HITBOX_HEAD,
	HITBOX_NECK,
	HITBOX_PELVIS,
	HITBOX_STOMACH,
	HITBOX_LOWER_CHEST,
	HITBOX_CHEST,
	HITBOX_UPPER_CHEST,
	HITBOX_RIGHT_THIGH,
	HITBOX_LEFT_THIGH,
	HITBOX_RIGHT_CALF,
	HITBOX_LEFT_CALF,
	HITBOX_RIGHT_FOOT,
	HITBOX_LEFT_FOOT,
	HITBOX_RIGHT_HAND,
	HITBOX_LEFT_HAND,
	HITBOX_RIGHT_UPPER_ARM,
	HITBOX_RIGHT_FOREARM,
	HITBOX_LEFT_UPPER_ARM,
	HITBOX_LEFT_FOREARM,
	HITBOX_MAX
};

struct model_t
{
	void* fnHandle; //0x0000
	char szName[260]; //0x0004
	int nLoadFlags; //0x0108
	int nServerCount; //0x010C
	int type; //0x0110
	int flags; //0x0114
	vec3 vecMins; //0x0118
	vec3 vecMaxs; //0x0124
	float radius; //0x0130
	char pad[0x1C]; //0x0134
};//Size=0x0150

#endif
